{
  "description": "Module for setup of UserAccountProfile Avi RESTful Object", 
  "parameters": {
    "username": {
      "type": "Optional[String]", 
      "description": "Username used for accessing Avi controller. The default value is the environment variable C(AVI_USERNAME)."
    }, 
    "max_concurrent_sessions": {
      "type": "Optional[String]", 
      "description": "Maximum number of concurrent sessions allowed. There are unlimited sessions by default. Default value when not specified in API or module is interpreted by Avi Controller as 0."
    }, 
    "uuid": {
      "type": "Optional[String]", 
      "description": "Unique object identifier of the object."
    }, 
    "url": {
      "type": "Optional[String]", 
      "description": "Avi controller URL of the object."
    }, 
    "credentials_timeout_threshold": {
      "type": "Optional[String]", 
      "description": "The time period after which credentials expire. Default is 180 days. Default value when not specified in API or module is interpreted by Avi Controller as 180."
    }, 
    "controller": {
      "type": "Optional[String]", 
      "description": "IP address or hostname of the controller. The default value is the environment variable C(AVI_CONTROLLER)."
    }, 
    "account_lock_timeout": {
      "type": "Optional[String]", 
      "description": "Lock timeout period (in minutes). Default is 30 minutes. Default value when not specified in API or module is interpreted by Avi Controller as 30."
    }, 
    "state": {
      "type": "Optional[String]", 
      "description": "The state that should be applied on the entity."
    }, 
    "max_login_failure_count": {
      "type": "Optional[String]", 
      "description": "Number of login attempts before lockout. Default is 3 attempts. Default value when not specified in API or module is interpreted by Avi Controller as 3."
    }, 
    "tenant": {
      "type": "Optional[String]", 
      "description": "Name of tenant used for all Avi API calls and context of object."
    }, 
    "max_password_history_count": {
      "type": "Optional[String]", 
      "description": "Maximum number of passwords to be maintained in the password history. Default is 4 passwords. Default value when not specified in API or module is interpreted by Avi Controller as 4."
    }, 
    "password": {
      "type": "Optional[String]", 
      "description": "Password of Avi user in Avi controller. The default value is the environment variable C(AVI_PASSWORD)."
    }, 
    "tenant_uuid": {
      "type": "Optional[String]", 
      "description": "UUID of tenant used for all Avi API calls and context of object."
    }, 
    "api_version": {
      "type": "Optional[String]", 
      "description": "Avi API version of to use for Avi API and objects."
    }, 
    "name": {
      "type": "String", 
      "description": "Name of the object."
    }
  }
}