{
  "description": "Module for setup of PoolGroup Avi RESTful Object", 
  "parameters": {
    "username": {
      "type": "Optional[String]", 
      "description": "Username used for accessing Avi controller. The default value is the environment variable C(AVI_USERNAME)."
    }, 
    "priority_labels_ref": {
      "type": "Optional[String]", 
      "description": "Uuid of the priority labels. If not provided, pool group member priority label will be interpreted as a number with a larger number considered higher priority. It is a reference to an object of type prioritylabels."
    }, 
    "description": {
      "type": "Optional[String]", 
      "description": "Description of pool group."
    }, 
    "tenant_uuid": {
      "type": "Optional[String]", 
      "description": "UUID of tenant used for all Avi API calls and context of object."
    }, 
    "cloud_ref": {
      "type": "Optional[String]", 
      "description": "It is a reference to an object of type cloud."
    }, 
    "min_servers": {
      "type": "Optional[String]", 
      "description": "The minimum number of servers to distribute traffic to. Allowed values are 1-65535. Special values are 0 - 'disable'. Default value when not specified in API or module is interpreted by Avi Controller as 0."
    }, 
    "tenant_ref": {
      "type": "Optional[String]", 
      "description": "It is a reference to an object of type tenant."
    }, 
    "state": {
      "type": "Optional[String]", 
      "description": "The state that should be applied on the entity."
    }, 
    "created_by": {
      "type": "Optional[String]", 
      "description": "Name of the user who created the object."
    }, 
    "name": {
      "type": "String", 
      "description": "The name of the pool group."
    }, 
    "url": {
      "type": "Optional[String]", 
      "description": "Avi controller URL of the object."
    }, 
    "controller": {
      "type": "Optional[String]", 
      "description": "IP address or hostname of the controller. The default value is the environment variable C(AVI_CONTROLLER)."
    }, 
    "cloud_config_cksum": {
      "type": "Optional[String]", 
      "description": "Checksum of cloud configuration for poolgroup. Internally set by cloud connector."
    }, 
    "api_version": {
      "type": "Optional[String]", 
      "description": "Avi API version of to use for Avi API and objects."
    }, 
    "members": {
      "type": "Optional[String]", 
      "description": "List of pool group members object of type poolgroupmember."
    }, 
    "fail_action": {
      "type": "Optional[String]", 
      "description": "Enable an action - close connection, http redirect, or local http response - when a pool group failure happens. By default, a connection will be closed, in case the pool group experiences a failure."
    }, 
    "password": {
      "type": "Optional[String]", 
      "description": "Password of Avi user in Avi controller. The default value is the environment variable C(AVI_PASSWORD)."
    }, 
    "deployment_policy_ref": {
      "type": "Optional[String]", 
      "description": "When setup autoscale manager will automatically promote new pools into production when deployment goals are met. It is a reference to an object of type poolgroupdeploymentpolicy."
    }, 
    "tenant": {
      "type": "Optional[String]", 
      "description": "Name of tenant used for all Avi API calls and context of object."
    }, 
    "uuid": {
      "type": "Optional[String]", 
      "description": "Uuid of the pool group."
    }
  }
}