{
  "description": "Manage BIG-IP global settings.", 
  "parameters": {
    "security_banner": {
      "type": "Optional[String]", 
      "description": "Specifies whether the system displays an advisory message on the login screen."
    }, 
    "net_reboot": {
      "type": "Optional[String]", 
      "description": "Specifies, when C(enabled), that the next time you reboot the system, the system boots to an ISO image on the network, rather than an internal media drive."
    }, 
    "banner_text": {
      "type": "Optional[String]", 
      "description": "Specifies the text to present in the advisory banner."
    }, 
    "console_timeout": {
      "type": "Optional[String]", 
      "description": "Specifies the number of seconds of inactivity before the system logs off a user that is logged on."
    }, 
    "quiet_boot": {
      "type": "Optional[String]", 
      "description": "Specifies, when C(enabled), that the system suppresses informational text on the console during the boot cycle. When C(disabled), the system presents messages and informational text on the console during the boot cycle."
    }, 
    "mgmt_dhcp": {
      "type": "Optional[String]", 
      "description": "Specifies whether or not to enable DHCP client on the management interface"
    }, 
    "server": {
      "type": "String", 
      "description": "The BIG-IP host. This option can be omitted if the environment variable C(F5_SERVER) is set."
    }, 
    "state": {
      "type": "Optional[String]", 
      "description": "The state of the variable on the system. When C(present), guarantees that an existing variable is set to C(value)."
    }, 
    "user": {
      "type": "String", 
      "description": "The username to connect to the BIG-IP with. This user must have administrative privileges on the device. This option can be omitted if the environment variable C(F5_USER) is set."
    }, 
    "server_port": {
      "type": "Optional[String]", 
      "description": "The BIG-IP server port. This option can be omitted if the environment variable C(F5_SERVER_PORT) is set."
    }, 
    "gui_setup": {
      "type": "Optional[String]", 
      "description": "C(enable) or C(disabled) the Setup utility in the browser-based Configuration utility"
    }, 
    "password": {
      "type": "String", 
      "description": "The password for the user account used to connect to the BIG-IP. This option can be omitted if the environment variable C(F5_PASSWORD) is set."
    }, 
    "validate_certs": {
      "type": "Optional[String]", 
      "description": "If C(no), SSL certificates will not be validated. This should only be used on personally controlled sites using self-signed certificates. This option can be omitted if the environment variable C(F5_VALIDATE_CERTS) is set."
    }, 
    "lcd_display": {
      "type": "Optional[String]", 
      "description": "Specifies, when C(enabled), that the system menu displays on the LCD screen on the front of the unit. This setting has no effect when used on the VE platform."
    }
  }
}