{
  "description": "Manage user accounts and user attributes on a BIG-IP.", 
  "parameters": {
    "update_password": {
      "type": "Optional[String]", 
      "description": "C(always) will allow to update passwords if the user chooses to do so. C(on_create) will only set the password for newly created users."
    }, 
    "shell": {
      "type": "Optional[String]", 
      "description": "Optionally set the users shell."
    }, 
    "server_port": {
      "type": "Optional[String]", 
      "description": "The BIG-IP server port. This option can be omitted if the environment variable C(F5_SERVER_PORT) is set."
    }, 
    "password_credential": {
      "type": "Optional[String]", 
      "description": "Set the users password to this unencrypted value. C(password_credential) is required when creating a new account."
    }, 
    "password": {
      "type": "String", 
      "description": "The password for the user account used to connect to the BIG-IP. This option can be omitted if the environment variable C(F5_PASSWORD) is set."
    }, 
    "partition_access": {
      "type": "Optional[String]", 
      "description": "Specifies the administrative partition to which the user has access. C(partition_access) is required when creating a new account. Should be in the form \"partition:role\". Valid roles include C(acceleration-policy-editor), C(admin), C(application-editor), C(auditor) C(certificate-manager), C(guest), C(irule-manager), C(manager), C(no-access) C(operator), C(resource-admin), C(user-manager), C(web-application-security-administrator), and C(web-application-security-editor). Partition portion of tuple should be an existing partition or the value 'all'."
    }, 
    "server": {
      "type": "String", 
      "description": "The BIG-IP host. This option can be omitted if the environment variable C(F5_SERVER) is set."
    }, 
    "state": {
      "type": "Optional[String]", 
      "description": "Whether the account should exist or not, taking action if the state is different from what is stated."
    }, 
    "user": {
      "type": "String", 
      "description": "The username to connect to the BIG-IP with. This user must have administrative privileges on the device. This option can be omitted if the environment variable C(F5_USER) is set."
    }, 
    "full_name": {
      "type": "Optional[String]", 
      "description": "Full name of the user."
    }, 
    "username_credential": {
      "type": "String", 
      "description": "Name of the user to create, remove or modify."
    }, 
    "validate_certs": {
      "type": "Optional[String]", 
      "description": "If C(no), SSL certificates will not be validated. This should only be used on personally controlled sites using self-signed certificates. This option can be omitted if the environment variable C(F5_VALIDATE_CERTS) is set."
    }
  }
}