{
  "description": "Manage route domains on a BIG-IP", 
  "parameters": {
    "flow_eviction_policy": {
      "type": "Optional[String]", 
      "description": "The eviction policy to use with this route domain. Apply an eviction policy to provide customized responses to flow overflows and slow flows on the route domain."
    }, 
    "vlans": {
      "type": "Optional[String]", 
      "description": "VLANs for the system to use in the route domain"
    }, 
    "service_policy": {
      "type": "Optional[String]", 
      "description": "Service policy to associate with the route domain."
    }, 
    "description": {
      "type": "Optional[String]", 
      "description": "Specifies descriptive text that identifies the route domain."
    }, 
    "parent": {
      "type": "Optional[String]", 
      "description": "S p e c i f i e s   t h e   r o u t e   d o m a i n   t h e   s y s t e m   s e a r c h e s   w h e n   i t   c a n n o t   f i n d   a   r o u t e   i n   t h e   c o n f i g u r e d   d o m a i n ."
    }, 
    "connection_limit": {
      "type": "Optional[String]", 
      "description": "The maximum number of concurrent connections allowed for the route domain. Setting this to C(0) turns off connection limits."
    }, 
    "server": {
      "type": "String", 
      "description": "The BIG-IP host. This option can be omitted if the environment variable C(F5_SERVER) is set."
    }, 
    "strict": {
      "type": "Optional[String]", 
      "description": "Specifies whether the system enforces cross-routing restrictions or not."
    }, 
    "state": {
      "type": "Optional[String]", 
      "description": "Whether the route domain should exist or not."
    }, 
    "user": {
      "type": "String", 
      "description": "The username to connect to the BIG-IP with. This user must have administrative privileges on the device. This option can be omitted if the environment variable C(F5_USER) is set."
    }, 
    "server_port": {
      "type": "Optional[String]", 
      "description": "The BIG-IP server port. This option can be omitted if the environment variable C(F5_SERVER_PORT) is set."
    }, 
    "bwc_policy": {
      "type": "Optional[String]", 
      "description": "The bandwidth controller for the route domain."
    }, 
    "password": {
      "type": "String", 
      "description": "The password for the user account used to connect to the BIG-IP. This option can be omitted if the environment variable C(F5_PASSWORD) is set."
    }, 
    "validate_certs": {
      "type": "Optional[String]", 
      "description": "If C(no), SSL certificates will not be validated. This should only be used on personally controlled sites using self-signed certificates. This option can be omitted if the environment variable C(F5_VALIDATE_CERTS) is set."
    }, 
    "id": {
      "type": "String", 
      "description": "The unique identifying integer representing the route domain."
    }, 
    "routing_protocol": {
      "type": "Optional[String]", 
      "description": "Dynamic routing protocols for the system to use in the route domain."
    }
  }
}