{
  "description": "Manage switch configuration using templates based on condition on devices running Lenovo CNOS", 
  "parameters": {
    "username": {
      "type": "String", 
      "description": "Configures the username used to authenticate the connection to the remote device. The value of the username parameter is used to authenticate the SSH session. While generally the value should come from the inventory file, you can also specify it as a variable. This parameter is optional. If it is not specified, no default value will be used."
    }, 
    "outputfile": {
      "type": "String", 
      "description": "This specifies the file path where the output of each command execution is saved. Each command that is specified in the merged template file and each response from the device are saved here. Usually the location is the results folder, but you can choose another location based on your write permission."
    }, 
    "flag": {
      "type": "String", 
      "description": "If a task needs to be executed, you have to set the flag the same as it is specified in the inventory for that device."
    }, 
    "host": {
      "type": "String", 
      "description": "This is the variable used to search the hosts file at /etc/ansible/hosts and identify the IP address of the device on which the template is going to be applied. Usually the Ansible keyword {{ inventory_hostname }} is specified in the playbook as an abstraction of the group of network elements that need to be configured."
    }, 
    "deviceType": {
      "type": "String", 
      "description": "This specifies the type of device where the method is executed."
    }, 
    "commandfile": {
      "type": "String", 
      "description": "This specifies the path to the CNOS command file which needs to be applied. This usually comes from the commands folder. Generally this file is the output of the variables applied on a template file. So this command is preceded by a template module. The command file must contain the Ansible keyword {{ inventory_hostname }} and the condition flag in its filename to ensure that the command file is unique for each switch and condition. If this is omitted, the command file will be overwritten during iteration. For example, commandfile=./commands/clos_leaf_bgp_{{ inventory_hostname }}_LP21_commands.txt"
    }, 
    "password": {
      "type": "String", 
      "description": "Configures the password used to authenticate the connection to the remote device. The value of the password parameter is used to authenticate the SSH session. While generally the value should come from the inventory file, you can also specify it as a variable. This parameter is optional. If it is not specified, no default value will be used."
    }, 
    "enablePassword": {
      "type": "Optional[String]", 
      "description": "Configures the password used to enter Global Configuration command mode on the switch. If the switch does not request this password, the parameter is ignored.While generally the value should come from the inventory file, you can also specify it as a variable. This parameter is optional. If it is not specified, no default value will be used."
    }, 
    "condition": {
      "type": "String", 
      "description": "If you specify condition=<flag string> in the inventory file against any device, the template execution is done for that device in case it matches the flag setting for that task."
    }
  }
}