{
  "description": "Return a list of files based on specific criteria", 
  "parameters": {
    "paths": {
      "type": "String", 
      "description": "List of paths of directories to search. All paths must be fully qualified."
    }, 
    "file_type": {
      "type": "Optional[String]", 
      "description": "Type of file to select. The 'link' and 'any' choices were added in version 2.3."
    }, 
    "age": {
      "type": "Optional[String]", 
      "description": "Select files whose age is equal to or greater than the specified time. Use a negative age to find files equal to or less than the specified time. You can choose seconds, minutes, hours, days, or weeks by specifying the first letter of any of those words (e.g., \"1w\")."
    }, 
    "contains": {
      "type": "Optional[String]", 
      "description": "One or more regex patterns which should be matched against the file content."
    }, 
    "recurse": {
      "type": "Optional[String]", 
      "description": "If target is a directory, recursively descend into the directory looking for files."
    }, 
    "age_stamp": {
      "type": "Optional[String]", 
      "description": "Choose the file property against which we compare age."
    }, 
    "patterns": {
      "type": "Optional[String]", 
      "description": "One or more (shell or regex) patterns, which type is controlled by C(use_regex) option. The patterns restrict the list of files to be returned to those whose basenames match at least one of the patterns specified. Multiple patterns can be specified using a list."
    }, 
    "get_checksum": {
      "type": "Optional[String]", 
      "description": "Set this to true to retrieve a file's sha1 checksum."
    }, 
    "use_regex": {
      "type": "Optional[String]", 
      "description": "If false the patterns are file globs (shell) if true they are python regexes."
    }, 
    "follow": {
      "type": "Optional[String]", 
      "description": "Set this to true to follow symlinks in path for systems with python 2.6+."
    }, 
    "hidden": {
      "type": "Optional[String]", 
      "description": "Set this to true to include hidden files, otherwise they'll be ignored."
    }, 
    "size": {
      "type": "Optional[String]", 
      "description": "Select files whose size is equal to or greater than the specified size. Use a negative size to find files equal to or less than the specified size. Unqualified values are in bytes, but b, k, m, g, and t can be appended to specify bytes, kilobytes, megabytes, gigabytes, and terabytes, respectively. Size is not evaluated for directories."
    }
  }
}