{
  "description": "Manage the system attributes on Cisco IOS XR devices", 
  "parameters": {
    "lookup_source": {
      "type": "Optional[String]", 
      "description": "The C(lookup_source) argument provides one or more source interfaces to use for performing DNS lookups.  The interface provided in C(lookup_source) must be a valid interface configured on the device."
    }, 
    "domain_search": {
      "type": "Optional[String]", 
      "description": "Provides the list of domain suffixes to append to the hostname for the purpose of doing name resolution. This argument accepts a list of names and will be reconciled with the current active configuration on the running node."
    }, 
    "hostname": {
      "type": "Optional[String]", 
      "description": "Configure the device hostname parameter. This option takes an ASCII string value."
    }, 
    "domain_name": {
      "type": "Optional[String]", 
      "description": "Configure the IP domain name on the remote device to the provided value. Value should be in the dotted name form and will be appended to the C(hostname) to create a fully-qualified domain name."
    }, 
    "state": {
      "type": "Optional[String]", 
      "description": "State of the configuration values in the device's current active configuration.  When set to I(present), the values should be configured in the device active configuration and when set to I(absent) the values should not be in the device active configuration"
    }, 
    "provider": {
      "type": "Optional[String]", 
      "description": "A dict object containing connection details."
    }, 
    "name_servers": {
      "type": "Optional[String]", 
      "description": "The C(name_serves) argument accepts a list of DNS name servers by way of either FQDN or IP address to use to perform name resolution lookups.  This argument accepts wither a list of DNS servers See examples."
    }, 
    "lookup_enabled": {
      "type": "Optional[Boolean]", 
      "description": "Provides administrative control for enabling or disabling DNS lookups.  When this argument is set to True, lookups are performed and when it is set to False, lookups are not performed."
    }
  }
}