{
  "description": "Manage the collection of local users on Cisco IOS XR device", 
  "parameters": {
    "update_password": {
      "type": "Optional[String]", 
      "description": "Since passwords are encrypted in the device running config, this argument will instruct the module when to change the password.  When set to C(always), the password will always be updated in the device and when set to C(on_create) the password will be updated only if the username is created."
    }, 
    "group": {
      "type": "Optional[String]", 
      "description": "Configures the group for the username in the device running configuration. The argument accepts a string value defining the group name. This argument does not check if the group has been configured on the device, alias C(role)."
    }, 
    "users": {
      "type": "Optional[String]", 
      "description": "The set of username objects to be configured on the remote Cisco IOS XR device. The list entries can either be the username or a hash of username and properties. This argument is mutually exclusive with the C(name) argument, alias C(collection)."
    }, 
    "purge": {
      "type": "Optional[Boolean]", 
      "description": "Instructs the module to consider the resource definition absolute. It will remove any previously configured usernames on the device with the exception of the `admin` user (the current defined set of users)."
    }, 
    "state": {
      "type": "Optional[String]", 
      "description": "Configures the state of the username definition as it relates to the device operational configuration. When set to I(present), the username(s) should be configured in the device active configuration and when set to I(absent) the username(s) should not be in the device active configuration"
    }, 
    "password": {
      "type": "Optional[String]", 
      "description": "The password to be configured on the Cisco IOS XR device. The password needs to be provided in clear and it will be encrypted on the device. Please note that this option is not same as C(provider password)."
    }, 
    "name": {
      "type": "Optional[String]", 
      "description": "The username to be configured on the Cisco IOS XR device. This argument accepts a string value and is mutually exclusive with the C(collection) argument. Please note that this option is not same as C(provider username)."
    }
  }
}