{
  "description": "Manage AWS Lambda functions", 
  "parameters": {
    "s3_key": {
      "type": "Optional[String]", 
      "description": "The Amazon S3 object (the deployment package) key name you want to upload"
    }, 
    "s3_object_version": {
      "type": "Optional[String]", 
      "description": "The Amazon S3 object (the deployment package) version you want to upload."
    }, 
    "memory_size": {
      "type": "Optional[String]", 
      "description": "The amount of memory, in MB, your Lambda function is given"
    }, 
    "ec2_url": {
      "type": "Optional[String]", 
      "description": "Url to use to connect to EC2 or your Eucalyptus cloud (by default the module will use EC2 endpoints). Ignored for modules where region is required. Must be specified for all other modules if region is not used. If not set then the value of the EC2_URL environment variable, if any, is used."
    }, 
    "aws_secret_key": {
      "type": "Optional[String]", 
      "description": "AWS secret key. If not set then the value of the AWS_SECRET_ACCESS_KEY, AWS_SECRET_KEY, or EC2_SECRET_KEY environment variable is used."
    }, 
    "state": {
      "type": "Optional[String]", 
      "description": "Create or delete Lambda function"
    }, 
    "handler": {
      "type": "Optional[String]", 
      "description": "The function within your code that Lambda calls to begin execution"
    }, 
    "role": {
      "type": "Optional[String]", 
      "description": "The Amazon Resource Name (ARN) of the IAM role that Lambda assumes when it executes your function to access any other Amazon Web Services (AWS) resources. You may use the bare ARN if the role belongs to the same AWS account."
    }, 
    "vpc_security_group_ids": {
      "type": "Optional[String]", 
      "description": "List of VPC security group IDs to associate with the Lambda function. Required when vpc_subnet_ids is used."
    }, 
    "profile": {
      "type": "Optional[String]", 
      "description": "Uses a boto profile. Only works with boto >= 2.24.0."
    }, 
    "description": {
      "type": "Optional[String]", 
      "description": "A short, user-defined function description. Lambda does not use this value. Assign a meaningful description as you see fit."
    }, 
    "zip_file": {
      "type": "Optional[String]", 
      "description": "A .zip file containing your deployment package"
    }, 
    "dead_letter_arn": {
      "type": "Optional[String]", 
      "description": "The parent object that contains the target Amazon Resource Name (ARN) of an Amazon SQS queue or Amazon SNS topic."
    }, 
    "aws_access_key": {
      "type": "Optional[String]", 
      "description": "AWS access key. If not set then the value of the AWS_ACCESS_KEY_ID, AWS_ACCESS_KEY or EC2_ACCESS_KEY environment variable is used."
    }, 
    "name": {
      "type": "String", 
      "description": "The name you want to assign to the function you are uploading. Cannot be changed."
    }, 
    "security_token": {
      "type": "Optional[String]", 
      "description": "AWS STS security token. If not set then the value of the AWS_SECURITY_TOKEN or EC2_SECURITY_TOKEN environment variable is used."
    }, 
    "s3_bucket": {
      "type": "Optional[String]", 
      "description": "Amazon S3 bucket name where the .zip file containing your deployment package is stored"
    }, 
    "timeout": {
      "type": "Optional[String]", 
      "description": "The function execution time at which Lambda should terminate the function."
    }, 
    "environment_variables": {
      "type": "Optional[String]", 
      "description": "A dictionary of environment variables the Lambda function is given."
    }, 
    "runtime": {
      "type": "String", 
      "description": "The runtime environment for the Lambda function you are uploading. Required when creating a function. Use parameters as described in boto3 docs. Current example runtime environments are nodejs, nodejs4.3, java8 or python2.7"
    }, 
    "validate_certs": {
      "type": "Optional[String]", 
      "description": "When set to \"no\", SSL certificates will not be validated for boto versions >= 2.6.0."
    }, 
    "region": {
      "type": "Optional[String]", 
      "description": "The AWS region to use. If not specified then the value of the AWS_REGION or EC2_REGION environment variable, if any, is used. See U(http://docs.aws.amazon.com/general/latest/gr/rande.html#ec2_region)"
    }, 
    "vpc_subnet_ids": {
      "type": "Optional[String]", 
      "description": "List of subnet IDs to run Lambda function in. Use this option if you need to access resources in your VPC. Leave empty if you don't want to run the function in a VPC."
    }
  }
}