{
  "description": "Manages BGP Address-family configuration.", 
  "parameters": {
    "username": {
      "type": "Optional[String]", 
      "description": "Configures the username to use to authenticate the connection to the remote device.  This value is used to authenticate either the CLI login or the nxapi authentication depending on which transport is used. If the value is not specified in the task, the value of environment variable C(ANSIBLE_NET_USERNAME) will be used instead."
    }, 
    "dampening_max_suppress_time": {
      "type": "Optional[String]", 
      "description": "Specify max suppress time for route-flap dampening stable route. Valid values are integer and keyword 'default'."
    }, 
    "additional_paths_send": {
      "type": "Optional[String]", 
      "description": "Enables the send capability of additional paths for all of the neighbors under this address family for which the capability has not been disabled."
    }, 
    "additional_paths_install": {
      "type": "Optional[String]", 
      "description": "Install a backup path into the forwarding table and provide prefix independent convergence (PIC) in case of a PE-CE link failure."
    }, 
    "networks": {
      "type": "Optional[String]", 
      "description": "Networks to configure. Valid value is a list of network prefixes to advertise. The list must be in the form of an array. Each entry in the array must include a prefix address and an optional route-map. For example [['10.0.0.0/16', 'routemap_LA'], ['192.168.1.1', 'Chicago'], ['192.168.2.0/24], ['192.168.3.0/24', 'routemap_NYC']]."
    }, 
    "dampening_state": {
      "type": "Optional[String]", 
      "description": "Enable/disable route-flap dampening."
    }, 
    "additional_paths_receive": {
      "type": "Optional[String]", 
      "description": "Enables the receive capability of additional paths for all of the neighbors under this address family for which the capability has not been disabled."
    }, 
    "suppress_inactive": {
      "type": "Optional[String]", 
      "description": "Advertises only active routes to peers."
    }, 
    "dampening_routemap": {
      "type": "Optional[String]", 
      "description": "Specify route-map for route-flap dampening. Valid values are a string defining the name of the route-map."
    }, 
    "use_ssl": {
      "type": "Optional[String]", 
      "description": "Configures the I(transport) to use SSL if set to true only when the C(transport=nxapi), otherwise this value is ignored."
    }, 
    "port": {
      "type": "Optional[String]", 
      "description": "Specifies the port to use when building the connection to the remote device.  This value applies to either I(cli) or I(nxapi).  The port value will default to the appropriate transport common port if none is provided in the task.  (cli=22, http=80, https=443)."
    }, 
    "transport": {
      "type": "String", 
      "description": "Configures the transport connection to use when connecting to the remote device.  The transport argument supports connectivity to the device over cli (ssh) or nxapi."
    }, 
    "distance_local": {
      "type": "Optional[String]", 
      "description": "Sets the administrative distance for local BGP routes. Valid values are Integer or keyword 'default'."
    }, 
    "advertise_l2vpn_evpn": {
      "type": "Optional[String]", 
      "description": "Advertise evpn routes."
    }, 
    "afi": {
      "type": "String", 
      "description": "Address Family Identifier."
    }, 
    "state": {
      "type": "Optional[String]", 
      "description": "Determines whether the config should be present or not on the device."
    }, 
    "distance_ibgp": {
      "type": "Optional[String]", 
      "description": "Sets the administrative distance for iBGP routes. Valid values are Integer or keyword 'default'."
    }, 
    "default_information_originate": {
      "type": "Optional[String]", 
      "description": "Default information originate."
    }, 
    "next_hop_route_map": {
      "type": "Optional[String]", 
      "description": "Configure a route-map for valid nexthops. Valid values are a string defining the name of the route-map."
    }, 
    "provider": {
      "type": "Optional[String]", 
      "description": "Convenience method that allows all I(nxos) arguments to be passed as a dict object.  All constraints (required, choices, etc) must be met either by individual arguments or values in this dict."
    }, 
    "table_map_filter": {
      "type": "Optional[String]", 
      "description": "Filters routes rejected by the route-map and does not download them to the RIB."
    }, 
    "timeout": {
      "type": "Optional[String]", 
      "description": "Specifies the timeout in seconds for communicating with the network device for either connecting or sending commands.  If the timeout is exceeded before the operation is completed, the module will error. NX-API can be slow to return on long-running commands (sh mac, sh bgp, etc)."
    }, 
    "safi": {
      "type": "String", 
      "description": "Sub Address Family Identifier."
    }, 
    "default_metric": {
      "type": "Optional[String]", 
      "description": "Sets default metrics for routes redistributed into BGP. Valid values are Integer or keyword 'default'"
    }, 
    "client_to_client": {
      "type": "Optional[String]", 
      "description": "Configure client-to-client route reflection."
    }, 
    "dampen_igp_metric": {
      "type": "Optional[String]", 
      "description": "Specify dampen value for IGP metric-related changes, in seconds. Valid values are integer and keyword 'default'."
    }, 
    "host": {
      "type": "String", 
      "description": "Specifies the DNS host name or address for connecting to the remote device over the specified transport.  The value of host is used as the destination address for the transport."
    }, 
    "additional_paths_selection": {
      "type": "Optional[String]", 
      "description": "Configures the capability of selecting additional paths for a prefix. Valid values are a string defining the name of the route-map."
    }, 
    "maximum_paths_ibgp": {
      "type": "Optional[String]", 
      "description": "Configures the maximum number of ibgp equal-cost paths for load sharing. Valid value is an integer in the range 1-64."
    }, 
    "vrf": {
      "type": "String", 
      "description": "Name of the VRF. The name 'default' is a valid VRF representing the global bgp."
    }, 
    "distance_ebgp": {
      "type": "Optional[String]", 
      "description": "Sets the administrative distance for eBGP routes. Valid values are Integer or keyword 'default'."
    }, 
    "password": {
      "type": "Optional[String]", 
      "description": "Specifies the password to use to authenticate the connection to the remote device.  This is a common argument used for either I(cli) or I(nxapi) transports. If the value is not specified in the task, the value of environment variable C(ANSIBLE_NET_PASSWORD) will be used instead."
    }, 
    "asn": {
      "type": "String", 
      "description": "BGP autonomous system number. Valid values are String, Integer in ASPLAIN or ASDOT notation."
    }, 
    "redistribute": {
      "type": "Optional[String]", 
      "description": "A list of redistribute directives. Multiple redistribute entries are allowed. The list must be in the form of a nested array. the first entry of each array defines the source-protocol to redistribute from; the second entry defines a route-map name. A route-map is highly advised but may be optional on some platforms, in which case it may be omitted from the array list. For example [['direct', 'rm_direct'], ['lisp', 'rm_lisp']]."
    }, 
    "ssh_keyfile": {
      "type": "Optional[String]", 
      "description": "Specifies the SSH key to use to authenticate the connection to the remote device.  This argument is only used for the I(cli) transport. If the value is not specified in the task, the value of environment variable C(ANSIBLE_NET_SSH_KEYFILE) will be used instead."
    }, 
    "dampening_reuse_time": {
      "type": "Optional[String]", 
      "description": "Specify route reuse time for route-flap dampening. Valid values are integer and keyword 'default'."
    }, 
    "maximum_paths": {
      "type": "Optional[String]", 
      "description": "Configures the maximum number of equal-cost paths for load sharing. Valid value is an integer in the range 1-64."
    }, 
    "inject_map": {
      "type": "Optional[String]", 
      "description": "An array of route-map names which will specify prefixes to inject. Each array entry must first specify the inject-map name, secondly an exist-map name, and optionally the copy-attributes keyword which indicates that attributes should be copied from the aggregate. For example [['lax_inject_map', 'lax_exist_map'], ['nyc_inject_map', 'nyc_exist_map', 'copy-attributes'], ['fsd_inject_map', 'fsd_exist_map']]."
    }, 
    "dampening_suppress_time": {
      "type": "Optional[String]", 
      "description": "Specify route suppress time for route-flap dampening. Valid values are integer and keyword 'default'."
    }, 
    "table_map": {
      "type": "Optional[String]", 
      "description": "Apply table-map to filter routes downloaded into URIB. Valid values are a string."
    }, 
    "dampening_half_time": {
      "type": "Optional[String]", 
      "description": "Specify decay half-life in minutes for route-flap dampening. Valid values are integer and keyword 'default'."
    }, 
    "validate_certs": {
      "type": "Optional[String]", 
      "description": "If C(no), SSL certificates will not be validated. This should only be used on personally controlled sites using self-signed certificates.  If the transport argument is not nxapi, this value is ignored."
    }
  }
}