{
  "description": "Push configuration to OpenSwitch", 
  "parameters": {
    "username": {
      "type": "Optional[String]", 
      "description": "Configures the username to use to authenticate the connection to the remote device.  This value is used to authenticate either the CLI login or the eAPI authentication depending on which transport is used. Note this argument does not affect the SSH transport. If the value is not specified in the task, the value of environment variable C(ANSIBLE_NET_USERNAME) will be used instead."
    }, 
    "src": {
      "type": "String", 
      "description": "The path to the config source.  The source can be either a file with config or a template that will be merged during runtime.  By default the task will search for the source file in role or playbook root folder in templates directory."
    }, 
    "ssh_keyfile": {
      "type": "Optional[String]", 
      "description": "Specifies the SSH key to use to authenticate the connection to the remote device.  This argument is only used for the I(cli) transports. If the value is not specified in the task, the value of environment variable C(ANSIBLE_NET_SSH_KEYFILE) will be used instead."
    }, 
    "force": {
      "type": "Optional[String]", 
      "description": "The force argument instructs the module to not consider the current devices running-config.  When set to true, this will cause the module to push the contents of I(src) into the device without first checking if already configured."
    }, 
    "config": {
      "type": "Optional[String]", 
      "description": "The module, by default, will connect to the remote device and retrieve the current running-config to use as a base for comparing against the contents of source.  There are times when it is not desirable to have the task get the current running-config for every task in a playbook.  The I(config) argument allows the implementer to pass in the configuration to use as the base config for comparison."
    }, 
    "host": {
      "type": "String", 
      "description": "Specifies the DNS host name or address for connecting to the remote device over the specified transport.  The value of host is used as the destination address for the transport.  Note this argument does not affect the SSH argument."
    }, 
    "timeout": {
      "type": "Optional[String]", 
      "description": "Specifies the timeout in seconds for communicating with the network device for either connecting or sending commands.  If the timeout is exceeded before the operation is completed, the module will error."
    }, 
    "provider": {
      "type": "Optional[String]", 
      "description": "Convenience method that allows all I(openswitch) arguments to be passed as a dict object.  All constraints (required, choices, etc) must be met either by individual arguments or values in this dict."
    }, 
    "use_ssl": {
      "type": "Optional[String]", 
      "description": "Configures the I(transport) to use SSL if set to true only when the I(transport) argument is configured as rest.  If the transport argument is not I(rest), this value is ignored."
    }, 
    "password": {
      "type": "Optional[String]", 
      "description": "Specifies the password to use to authenticate the connection to the remote device.  This is a common argument used for either I(cli) or I(rest) transports.  Note this argument does not affect the SSH transport. If the value is not specified in the task, the value of environment variable C(ANSIBLE_NET_PASSWORD) will be used instead."
    }, 
    "backup": {
      "type": "Optional[String]", 
      "description": "When this argument is configured true, the module will backup the running-config from the node prior to making any changes. The backup file will be written to backups/ in the root of the playbook directory."
    }, 
    "port": {
      "type": "Optional[String]", 
      "description": "Specifies the port to use when building the connection to the remote device.  This value applies to either I(cli) or I(rest).  The port value will default to the appropriate transport common port if none is provided in the task.  (cli=22, http=80, https=443).  Note this argument does not affect the SSH transport."
    }, 
    "transport": {
      "type": "String", 
      "description": "Configures the transport connection to use when connecting to the remote device.  The transport argument supports connectivity to the device over ssh, cli or REST."
    }
  }
}