{
  "description": "Adds or removes mysql users from proxysql admin interface.", 
  "parameters": {
    "username": {
      "type": "String", 
      "description": "Name of the user connecting to the mysqld or ProxySQL instance."
    }, 
    "default_hostgroup": {
      "type": "Optional[String]", 
      "description": "If there is no matching rule for the queries sent by this user, the traffic it generates is sent to the specified hostgroup. If omitted the proxysql database default for I(use_ssl) is 0."
    }, 
    "frontend": {
      "type": "Optional[String]", 
      "description": "If I(frontend) is set to C(True), this (username, password) pair is used for authenticating to the mysqld servers against any hostgroup."
    }, 
    "default_schema": {
      "type": "Optional[String]", 
      "description": "The schema to which the connection should change to by default."
    }, 
    "transaction_persistent": {
      "type": "Optional[String]", 
      "description": "If this is set for the user with which the MySQL client is connecting to ProxySQL (thus a \"frontend\" user), transactions started within a hostgroup will remain within that hostgroup regardless of any other rules. If omitted the proxysql database default for I(transaction_persistent) is C(False)."
    }, 
    "login_port": {
      "type": "Optional[String]", 
      "description": "The port used to connect to ProxySQL admin interface."
    }, 
    "login_user": {
      "type": "Optional[String]", 
      "description": "The username used to authenticate to ProxySQL admin interface."
    }, 
    "login_host": {
      "type": "Optional[String]", 
      "description": "The host used to connect to ProxySQL admin interface."
    }, 
    "login_password": {
      "type": "Optional[String]", 
      "description": "The password used to authenticate to ProxySQL admin interface."
    }, 
    "use_ssl": {
      "type": "Optional[String]", 
      "description": "If I(use_ssl) is set to C(True), connections by this user will be made using SSL connections. If omitted the proxysql database default for I(use_ssl) is C(False)."
    }, 
    "backend": {
      "type": "Optional[String]", 
      "description": "If I(backend) is set to C(True), this (username, password) pair is used for authenticating to the ProxySQL instance."
    }, 
    "state": {
      "type": "Optional[String]", 
      "description": "When C(present) - adds the user, when C(absent) - removes the user."
    }, 
    "fast_forward": {
      "type": "Optional[String]", 
      "description": "If I(fast_forward) is set to C(True), I(fast_forward) will bypass the query processing layer (rewriting, caching) and pass through the query directly as is to the backend server. If omitted the proxysql database default for I(fast_forward) is C(False)."
    }, 
    "load_to_runtime": {
      "type": "Optional[String]", 
      "description": "Dynamically load mysql host config to runtime memory."
    }, 
    "save_to_disk": {
      "type": "Optional[String]", 
      "description": "Save mysql host config to sqlite db on disk to persist the configuration."
    }, 
    "active": {
      "type": "Optional[String]", 
      "description": "A user with I(active) set to C(False) will be tracked in the database, but will be never loaded in the in-memory data structures. If omitted the proxysql database default for I(active) is C(True)."
    }, 
    "config_file": {
      "type": "Optional[String]", 
      "description": "Specify a config file from which login_user and login_password are to be read."
    }, 
    "password": {
      "type": "Optional[String]", 
      "description": "Password of the user connecting to the mysqld or ProxySQL instance."
    }, 
    "max_connections": {
      "type": "Optional[String]", 
      "description": "The maximum number of connections ProxySQL will open to the backend for this user. If omitted the proxysql database default for I(max_connections) is 10000."
    }
  }
}