{
  "description": "Assume a role using AWS Security Token Service and obtain temporary credentials", 
  "parameters": {
    "aws_secret_key": {
      "type": "Optional[String]", 
      "description": "AWS secret key. If not set then the value of the AWS_SECRET_ACCESS_KEY, AWS_SECRET_KEY, or EC2_SECRET_KEY environment variable is used."
    }, 
    "profile": {
      "type": "Optional[String]", 
      "description": "Uses a boto profile. Only works with boto >= 2.24.0."
    }, 
    "aws_access_key": {
      "type": "Optional[String]", 
      "description": "AWS access key. If not set then the value of the AWS_ACCESS_KEY_ID, AWS_ACCESS_KEY or EC2_ACCESS_KEY environment variable is used."
    }, 
    "role_arn": {
      "type": "String", 
      "description": "The Amazon Resource Name (ARN) of the role that the caller is assuming (http://docs.aws.amazon.com/IAM/latest/UserGuide/Using_Identifiers.html#Identifiers_ARNs)"
    }, 
    "security_token": {
      "type": "Optional[String]", 
      "description": "AWS STS security token. If not set then the value of the AWS_SECURITY_TOKEN or EC2_SECURITY_TOKEN environment variable is used."
    }, 
    "duration_seconds": {
      "type": "Optional[String]", 
      "description": "The duration, in seconds, of the role session. The value can range from 900 seconds (15 minutes) to 3600 seconds (1 hour). By default, the value is set to 3600 seconds."
    }, 
    "external_id": {
      "type": "Optional[String]", 
      "description": "A unique identifier that is used by third parties to assume a role in their customers' accounts."
    }, 
    "region": {
      "type": "Optional[String]", 
      "description": "The AWS region to use. If not specified then the value of the AWS_REGION or EC2_REGION environment variable, if any, is used. See U(http://docs.aws.amazon.com/general/latest/gr/rande.html#ec2_region)"
    }, 
    "role_session_name": {
      "type": "String", 
      "description": "Name of the role's session - will be used by CloudTrail"
    }, 
    "mfa_token": {
      "type": "Optional[String]", 
      "description": "The value provided by the MFA device, if the trust policy of the role being assumed requires MFA."
    }, 
    "ec2_url": {
      "type": "Optional[String]", 
      "description": "Url to use to connect to EC2 or your Eucalyptus cloud (by default the module will use EC2 endpoints). Ignored for modules where region is required. Must be specified for all other modules if region is not used. If not set then the value of the EC2_URL environment variable, if any, is used."
    }, 
    "policy": {
      "type": "Optional[String]", 
      "description": "Supplemental policy to use in addition to assumed role's policies."
    }, 
    "validate_certs": {
      "type": "Optional[String]", 
      "description": "When set to \"no\", SSL certificates will not be validated for boto versions >= 2.6.0."
    }, 
    "mfa_serial_number": {
      "type": "Optional[String]", 
      "description": "he identification number of the MFA device that is associated with the user who is making the AssumeRole call."
    }
  }
}